export const AestheticsQuestions = <const>[
  'Ходил ли ты в театр за последние полгода?',
  'Тебе интересна классическая музыка?',
  'Посещал ли ты художественные выставки за последние полгода?',
  'Тебе нравится посещать музеи?',
  'Ты получаешь удовольствие от изучения архитектуры?'
]

export const HobbyQuestions = <const>[
  {value: 'Любишь ли ты смотреть кино?', label: 'movie'},
  {value: 'Занимался ли ты рисованием?', label: 'draw'},
  {value: 'Ты считаешь себя физически активным человеком?', label: 'sport'},
  {value: 'Хорошо ли ты относишься к киберспорту?', label: 'cybersport'},
  {value: 'Ты когда-нибудь занимался танцами?', label: 'dance'},
  {value: 'Ты сочинял песни/музыку?', label: 'music'},
  {value: 'Считаешь ли ты себя книголюбом?', label: 'book'},
  {value: 'Ты получаешь удовольствие от приготовления еды?', label: 'food'},
  {value: 'Увлекался ли ты изучением иностранных языков?', label: 'language'},
  {value: 'Собирал ли ты коллекции чего-либо?', label: 'collections'}
]

export const HobbyQuestionsLabel = <const>[
  'movie',
  'draw',
  'sport',
  'cybersport',
  'dance',
  'music',
  'book',
  'food',
  'language',
  'collections'
]

export const resumes = [
  'У вас больше шансов на дружбу с крокодилом, чем с этим человеком.',
  '"Не унывайте, может быть, вы найдете свою дружбу в мире мемов и котиков в интернете."',
  'Можно питать надежды на улучшение отношений... но все равно стоит иметь на руках книгу "Как найти нового друга"',
  'Не все потеряно, вы хорошие товарищи! Но по поводу дружбы стоит призадуматься',
  'Скорее всего, вы сможете стать друзьями, но вам придется делать компромиссы, например, позволять друг другу включать Моргенштерна.',
  'Вы можете разделить бутылку вина и плакать о своей неудачной дружбе вместе, но не забудьте закусить сыром и колбасой.',
  'Достаточно хороший друг, чтобы сходить на концерт, но не настолько, чтобы одолжить тебе деньги.',
  'Вы идеально подходите друг другу, как два пазла, но иногда вам все же нужно небольшое усилие, чтобы подогнать все вместе.',
  'Ура! Душевные связи в порядке. Вперед, наслаждаемся обществом и делаем жизнь ярче.',
  'Вы – лучшие друзья навсегда, как в «Игре престолов», только без мести и двуличия.'
]

export const recommendations = [
  'Выберите и посмотрите фильм',
  'Нарисуйте то, как вы видите вашего друга и подарите ему получившийся рисунок',
  'Выберите и начните смотреть вместе сериал',
  'Составьте топ-5 своих любимых песен, отправьте друг другу и поделитесь впечатлениями',
  'Сыграйте в боулинг',
  'Порисуйте на свежем воздухе'
]

export const unrecommendations = [
  'Принижать интересы собеседника',
  'Манипулировать друзьями, используя общие интересы',
  'Критиковать достижения друзей в их любимом деле',
  'Игнорировать интересы друзей',
  'Постоянно соревноваться во всем',
  'Насмехаться над хобби друга',
  'Не уважать интересы друга'
]
